tests/auto_build/testcases/wsdls/ComplexTypeChoiceArrayChild.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
	xmlns:tns="http://xsd_byte.test.apache.org"
	xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema" name="XSD_byte"
	targetNamespace="http://xsd_byte.test.apache.org">
	<wsdl:types>
		<xsd:schema
			targetNamespace="http://xsd_byte.test.apache.org"
			xmlns:xsd="http://www.w3.org/2001/XMLSchema">
						
			<xsd:complexType name="SimpleComplexType1">
				<xsd:choice>
					<xsd:element name="arrayElement" type="tns:SimpleArray" />
					<xsd:element name="field2" type="xsd:string" nillable="false" />
					<xsd:element name="field3" type="xsd:int" nillable="false" />
				</xsd:choice>
			</xsd:complexType>				
			
			<xsd:complexType name="SimpleArray">
				<xsd:sequence>
					<xsd:element name="intArray" type="xsd:int" maxOccurs="unbounded" />					
				</xsd:sequence>
			</xsd:complexType>

			<xsd:element name="asComplexTypeResponse">
				<xsd:complexType>
					<xsd:sequence>
						<xsd:element name="SimpleComplexType1" type="tns:SimpleComplexType1" nillable="false" minOccurs="1" maxOccurs="1" />
					</xsd:sequence>
				</xsd:complexType>
			</xsd:element>
			<xsd:element name="asComplexTypeRequest">
				<xsd:complexType>
					<xsd:sequence>
						<xsd:element name="SimpleComplexType1" type="tns:SimpleComplexType1" nillable="false" minOccurs="1" maxOccurs="1" />
					</xsd:sequence>
				</xsd:complexType>
			</xsd:element>
		</xsd:schema>
	</wsdl:types>
	
	<wsdl:message name="asComplexTypeResponse">
		<wsdl:part name="asComplexTypeResponse"
			element="tns:asComplexTypeResponse">
		</wsdl:part>
	</wsdl:message>
	<wsdl:message name="asComplexTypeRequest">
		<wsdl:part name="asComplexTypeRequest"
			element="tns:asComplexTypeRequest">
		</wsdl:part>
	</wsdl:message>
	<wsdl:portType name="XSD_byte">
		<wsdl:operation name="asComplexType">
			<wsdl:input message="tns:asComplexTypeRequest"></wsdl:input>
			<wsdl:output message="tns:asComplexTypeResponse"></wsdl:output>
		</wsdl:operation>
	</wsdl:portType>
	
	<wsdl:binding name="ComplexTypeChoiceArrayChildSOAP" type="tns:XSD_byte">
		<soap:binding style="document"
			transport="http://schemas.xmlsoap.org/soap/http" />
		
		
		<wsdl:operation name="asComplexType">
			<soap:operation soapAction="XSD_byte#asComplexType"
				style="document" />
			<wsdl:input>
				<soap:body use="literal" />
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal" />
			</wsdl:output>
		</wsdl:operation>
	</wsdl:binding>
	<wsdl:service name="XSD_byte">
		<wsdl:port binding="tns:ComplexTypeChoiceArrayChildSOAP"
			name="Service">
			<soap:address
				location="http://localhost:9080/ComplexTypeChoiceArrayChild/services/Service" />
		</wsdl:port>
	</wsdl:service>
</wsdl:definitions>
