tests/auto_build/testcases/output/ComplexTypeChoiceArrayChild.request

POST /ComplexTypeChoiceArrayChild/services/Service HTTP/1.1
Host: 127.0.0.1:13260
Content-Type: text/xml; charset=UTF-8
SOAPAction: "XSD_byte#asComplexType"
Content-Length: 498

<?xml version='1.0' encoding='utf-8' ?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<SOAP-ENV:Body>
<ns1:asComplexType xmlns:ns1="http://xsd_byte.test.apache.org">
<SimpleComplexType1><arrayElement><intArray>5</intArray>
<intArray>6</intArray>
<intArray>7</intArray>
</arrayElement></SimpleComplexType1>
</ns1:asComplexType>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>

